MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX274F256B.atdf
      <value-group caption="Peripheral Bus x Clock Divisor Ready bit" name="PB1DIV__PBDIVRDY">
         <value caption="Clock divisor logic is not switching divisors and the PBDIV bits may be written" name="READY" value="0x1" />
         <value caption="Clock divisor logic is currently switching values and the PBDIV bits cannot be written" name="NOT_READY" value="0x0" />
      </value-group>
      <value-group caption="Output Enable bit" name="PB1DIV__ON">
         <value caption="PBCLK output clock is enabled" name="ENABLED" value="0x1" />
         <value caption="PBCLK output clock is disabled" name="DISABLED" value="0x0" />
      </value-group>
   </module>
   <module caption="Reset Controller" id="03100" name="RCON" version="1">
      <register-group name="RCON">
         <register caption="Peripheral Bus Clock Divisor Control Register" name="RCON" offset="0x40" rw="RW" size="4">
            <bitfield caption="VBPOR Mode Flag bit" mask="0x00020000" name="VBPOR" values="RCON__VBPOR" />
            <bitfield caption="VBAT Mode Flag bit" mask="0x00010000" name="VBAT" values="RCON__VBAT" />
            <bitfield caption="Deep Sleep Mode Flag bit" mask="0x00000400" name="DPSLP" values="RCON__DPSLP" />
            <bitfield caption="Configuration Mismatch Reset Flag bit" mask="0x00000200" name="CMR" values="RCON__CMR" />
            <bitfield caption="External Reset (MCLR) Pin Flag bit" mask="0x00000080" name="EXTR" values="RCON__EXTR" />
            <bitfield caption="Software Reset Flag bit" mask="0x00000040" name="SWR" values="RCON__SWR" />
            <bitfield caption="Watchdog Timer Time-out Flag bit" mask="0x00000010" name="WDTO" values="RCON__WDTO" />
            <bitfield caption="Wake From Sleep Flag bit" mask="0x00000008" name="SLEEP" values="RCON__SLEEP" />
            <bitfield caption="Wake From Idle Flag bit" mask="0x00000004" name="IDLE" values="RCON__IDLE" />
            <bitfield caption="Brown-out Reset Flag bit" mask="0x00000002" name="BOR" values="RCON__BOR" />
            <bitfield caption="Power-on Reset Flag bit" mask="0x00000001" name="POR" values="RCON__POR" />
         </register>
         <register caption="Non-maskable Interrupt (NMI) Control Register" name="RNMICON" offset="0x60" rw="RW" size="4">
            <bitfield caption="Watchdog Timer Time-Out Flag bit" mask="0x01000000" name="WDTO" values="RCON__WDTO" />
            <bitfield caption="Software NMI Trigger" mask="0x00800000" name="SWNMI" values="RCON__SWNMI" />
            <bitfield caption="General NMI bit" mask="0x00080000" name="GNMI" values="RCON__GNMI" />
            <bitfield caption="High/Low-Voltage Detect bit" mask="0x00040000" name="HLVD" values="RCON__HLVD" />
            <bitfield caption="Clock Fail Detect bit" mask="0x00020000" name="CF" values="RCON__CF" />
            <bitfield caption="Watchdog Timer Time-out in Sleep Mode Flag bit" mask="0x00010000" name="WDTS" values="RCON__WDTS" />
            <bitfield caption="NMI Reset Counter Value bits" mask="0x0000FFFF" name="NMICNT" values="RCON__NMICNT" />
         </register>
         <register caption="Power Control Register" name="PWRCON" offset="0x70" rw="RW" size="4">
            <bitfield caption="Voltage Regulator Stand-by Enable bit" mask="0x1" name="VREGS" values="RCON__VREGS" />
         </register>
      </register-group>
      <value-group caption="VBPOR Mode Flag bit" name="RCON__VBPOR">
         <value caption="A VBAT domain POR has occurred" name="POR" value="0x1" />
         <value caption="A VBAT domain POR has not occurred" name="NO_POR" value="0x0" />
      </value-group>
      <value-group caption="Deep Sleep Mode Flag bit" name="RCON__DPSLP">
         <value caption="Deep Sleep mode has occurred" name="DSLP" value="0x1" />
         <value caption="Deep Sleep mode has not occurred" name="NO_DSLP" value="0x0" />
      </value-group>
      <value-group caption="Configuration Mismatch Reset Flag bit" name="RCON__CMR">
         <value caption="A Configuration Mismatch Reset has occurred" name="MISMATCH" value="0x1" />
         <value caption="A Configuration Mismatch Reset has not occurred" name="NO_MISMATCH" value="0x0" />
      </value-group>
      <value-group caption="External Reset (MCLR) Pin Flag bit" name="RCON__EXTR">
         <value caption="Master Clear (pin) Reset has occurred" name="RESET" value="0x1" />
         <value caption="Master Clear (pin) Reset has not occurred" name="NO_RESET" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Flag bit" name="RCON__SWR">
         <value caption="Software Reset was executed" name="SW_RESET" value="0x1" />
         <value caption="Software Reset was not executed" name="NO_SW_RESET" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out Flag bit" name="RCON__WDTO">
         <value caption="WDT Time-out has occurred" name="WDTO" value="0x1" />
         <value caption="WDT Time-out has not occurred" name="NO_WDTO" value="0x0" />
      </value-group>
      <value-group caption="Wake From Sleep Flag bit" name="RCON__SLEEP">
         <value caption="Device was in Sleep mode" name="SLEEP" value="0x1" />
         <value caption="Device was not in Sleep mode" name="NO_SLEEP" value="0x0" />
      </value-group>
      <value-group caption="Wake From Idle Flag bit" name="RCON__IDLE">
         <value caption="Device was in Idle mode" name="IDLE" value="0x1" />
         <value caption="Device was not in Idle mode" name="NO_IDLE" value="0x0" />
      </value-group>
      <value-group caption="Brown-out Reset Flag bit" name="RCON__BOR">
         <value caption="Brown-out Reset has occurred" name="BOR" value="0x1" />
         <value caption="Brown-out Reset has not occurred" name="NO_BOR" value="0x0" />
      </value-group>
      <value-group caption="Power-on Reset Flag bit" name="RCON__POR">
         <value caption="Power-on Reset has occurred" name="POR" value="0x1" />
         <value caption="Power-on Reset has not occurred" name="NO_POR" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-Out Flag bit" name="RNMICON__WDTO">
         <value caption="WDT time-out has occurred and caused a NMI" name="WDTO" value="0x1" />
         <value caption="WDT time-out has not occurred" name="NO_WDTO" value="0x0" />
      </value-group>
      <value-group caption="Software NMI Trigger" name="RNMICON__SWNMI">
         <value caption="An NMI will be generated" name="ENABLE" value="0x1" />
         <value caption="An NMI will not be generated" name="DISABLE" value="0x0" />
      </value-group>
      <value-group caption="General NMI bit" name="RNMICON__GNMI">
         <value caption="A general NMI event has been detected or a user-initiated NMI event has occurred" name="GNMI" value="0x1" />
         <value caption="A general NMI event has not been detected" name="NO_GNMI" value="0x0" />
      </value-group>
      <value-group caption="High/Low-Voltage Detect bit" name="RNMICON__HLVD">
         <value caption="HLVD has detected a low-voltage condition and caused an NMI" name="LOW_VOLTAGE" value="0x1" />
         <value caption="HLVD has not detected a low-voltage condition" name="NO_LOW_VOLTAGE" value="0x0" />
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="RNMICON__CF">
         <value caption="FSCM has detected clock failure and caused an NMI" name="CLK_FAILURE" value="0x1" />
         <value caption="FSCM has not detected clock failure" name="NO_CLK_FAILURE" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out in Sleep Mode Flag bit" name="RNMICON__WDTS">
         <value caption="WDT time-out has occurred during Sleep mode and caused a wake-up from sleep" name="WDTO" value="0x1" />
         <value caption="WDT time-out has not occurred during Sleep mode" name="NO_WDTO" value="0x0" />
      </value-group>
