MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX274F256B.atdf
         <register caption="Flash Program Data Register" name="NVMDATA" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA" />
         </register>
         <register caption="Source Data Address Register" name="NVMSRCADDR" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMSRCADDR" />
         </register>
      </register-group>
      <value-group caption="NVM Operation bits" name="NVMCON__NVMOP">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Reserved" name="" value="0x7" />
         <value caption="No operation" name="" value="0x6" />
         <value caption="Program Flash Memory (PFM) erase operation: erases PFM" name="" value="0x5" />
         <value caption="Page erase operation: erases page selected by NVMADDR" name="" value="0x4" />
         <value caption="Row program operation: programs row selected by NVMADDR" name="" value="0x3" />
         <value caption="No operation" name="" value="0x2" />
         <value caption="Word program operation: programs word selected by NVMADDR" name="" value="0x1" />
         <value caption="No operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Voltage Detect Status bit (LVD circuit must be enabled)" name="NVMCON__LVDSTAT">
         <value caption="Low-voltage event is active" name="" value="0x1" />
         <value caption="Low-voltage event is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Voltage Detect Error bit (LVD circuit must be enabled)" name="NVMCON__LVDERR">
         <value caption="Low-voltage detected (possible data corruption" name="" value="0x1" />
         <value caption="Voltage level is acceptable for programming" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Error bit (LVD circuit must be enabled)" name="NVMCON__WRERR">
         <value caption="Program or erase sequence did not complete successfully" name="" value="0x1" />
         <value caption="Program or erase sequence completed normally" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Enable bit" name="NVMCON__WREN">
         <value caption="Enable writes to WR bit and enables HLVD circuit" name="" value="0x1" />
         <value caption="Disable writes to WR bit and disables HLVD circuit" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Control bit" name="NVMCON__WR">
         <value caption="Initiate a Flash operation. Hardware clears this bit when the operation completes" name="" value="0x1" />
         <value caption="Flash operation is complete or inactive" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00749" name="OCMP" version="1">
      <register-group name="OCMP">
         <register caption="Output Compare 'x' Control Register" name="OC1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC1CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC1CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC1CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC1CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC1CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC1CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC2CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC2CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC2CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC2CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC2CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC2CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC2CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC3CON" offset="0x400" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC3CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC3CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC3CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC3CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC3CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC3CON__ON" />
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC4CON" offset="0x600" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC4CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC4CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC4CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC4CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC4CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC4CON__ON" />
         </register>
