MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX274F256B.atdf
      <value-group caption="Increment Mode bits" name="PMMODE__INCM">
         <value caption="Slave mode read and write buffers auto-increment (MODE = 00 only)" name="" value="0x3" />
         <value caption="Decrement ADDR(10:2) and ADDR(14) by 1 every read/write cycle" name="" value="0x2" />
         <value caption="Increment ADDR(10:2) and ADDR(14) by 1 every read/write cycle" name="" value="0x1" />
         <value caption="No increment or decrement of address" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Request Mode bits" name="PMMODE__IRQM">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Interrupt is generated when Read Buffer 3 is read or Write Buffer 3 is written (Buffered PSP mode)or on a read or write operation when PMA = 11 (Addressable Slave mode only)" name="" value="0x2" />
         <value caption="Interrupt is generated at the end of the read/write cycle" name="" value="0x1" />
         <value caption="No Interrupt is generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Busy bit" name="PMMODE__BUSY">
         <value caption="Port is busy" name="" value="0x1" />
         <value caption="Port is not busy" name="" value="0x0" />
      </value-group>
      <value-group caption="Destination Address bits" name="PMADDR__ADDR">
         <value caption="Address is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 1 bit" name="PMADDR__CS1">
         <value caption="Chip Select 1 is active" name="" value="0x1" />
         <value caption="Chip Select 1 is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="PMALH/PMALL Strobe Enable bits" name="PMAEN__PTEN">
         <value caption="PMA1 and PMA0 function as either PMA or PMALH and PMALL" name="" value="0x1" />
         <value caption="PMA1 and PMA0 pads function as port I/O" name="" value="0x0" />
      </value-group>
      <value-group caption="PMP Address Port Enable bits" name="PMAEN__PTEN10">
         <value caption="PMA(10:2) function as PMP address lines" name="" value="0x7fc" />
         <value caption="PMA(10:2) function as  port I/O" name="" value="0x0" />
      </value-group>
      <value-group caption="PMCS1 Address Port Enable bits" name="PMAEN__PTEN14">
         <value caption="PMCS1" name="" value="0x1" />
         <value caption="PMCS1 functions as port I/O" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer 0 Status Empty bit" name="PMSTAT__OB0E">
         <value caption="Output buffer is empty (writing data to the buffer will clear this bit)" name="" value="0x1" />
         <value caption="Output buffer contains data that has not been transmitted" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer 1 Status Empty bit" name="PMSTAT__OB1E">
         <value caption="Output buffer is empty (writing data to the buffer will clear this bit)" name="" value="0x1" />
         <value caption="Output buffer contains data that has not been transmitted" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer 2 Status Empty bit" name="PMSTAT__OB2E">
         <value caption="Output buffer is empty (writing data to the buffer will clear this bit)" name="" value="0x1" />
         <value caption="Output buffer contains data that has not been transmitted" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer 3 Status Empty bit" name="PMSTAT__OB3E">
         <value caption="Output buffer is empty (writing data to the buffer will clear this bit)" name="" value="0x1" />
         <value caption="Output buffer contains data that has not been transmitted" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer Underflow Status bit" name="PMSTAT__OBUF">
         <value caption="A read occurred from an empty output byte buffer (must be cleared in software)" name="" value="0x1" />
         <value caption="No underflow is occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer Empty Status bit" name="PMSTAT__OBE">
         <value caption="All readable output buffer registers are empty" name="" value="0x1" />
         <value caption="Some or all of the readable output buffer registers are full" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer 0 Status Full bit" name="PMSTAT__IB0F">
         <value caption="Input Buffer contains data that has not been read (reading buffer will clear this bit)" name="" value="0x1" />
         <value caption="Input Buffer does not contain any unread data" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer 1 Status Full bit" name="PMSTAT__IB1F">
         <value caption="Input Buffer contains data that has not been read (reading buffer will clear this bit)" name="" value="0x1" />
         <value caption="Input Buffer does not contain any unread data" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer 2 Status Full bit" name="PMSTAT__IB2F">
         <value caption="Input Buffer contains data that has not been read (reading buffer will clear this bit)" name="" value="0x1" />
         <value caption="Input Buffer does not contain any unread data" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer 3 Status Full bit" name="PMSTAT__IB3F">
         <value caption="Input Buffer contains data that has not been read (reading buffer will clear this bit)" name="" value="0x1" />
         <value caption="Input Buffer does not contain any unread data" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer Overflow Status bit" name="PMSTAT__IBOV">
         <value caption="A write attempt to a full input byte buffer is occurred (must be cleared in software)" name="" value="0x1" />
         <value caption="No overflow is occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer Full Status bit" name="PMSTAT__IBF">
         <value caption="All writable input buffer registers are full" name="" value="0x1" />
         <value caption="Some or all of the writable input buffer registers are empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Address bits" name="PMWADDR__WADDR">
         <value caption="Address is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 1 bit" name="PMWADDR__WCS1">
         <value caption="Chip Select 1 is active" name="" value="0x1" />
         <value caption="Chip Select 1 is inactive, PMA14 is active" name="" value="0x0" />
      </value-group>
      <value-group caption="Address bits" name="PMWADDR__RADDR">
         <value caption="Address is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 1 bit" name="PMRADDR__RCS1">
         <value caption="Chip Select 1 is active" name="" value="0x1" />
         <value caption="Chip Select 1 is inactive (RADDR14 function is selected)" name="" value="0x0" />
      </value-group>
      <value-group caption="Address bits" name="PMRDIN__RDATAIN">
         <value caption="Port Read Input Data Bits are 0" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01423" name="PORT" version="">
      <register-group name="PORT">
         <register caption="" name="ANSELA" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELA" />
            <bitfield mask="0x00000002" name="ANSELA" />
            <bitfield mask="0x00000004" name="ANSELA" />
            <bitfield mask="0x00000008" name="ANSELA" />
            <bitfield mask="0x00000010" name="ANSELA" />
            <bitfield mask="0x00000020" name="ANSELA" />
            <bitfield mask="0x00000040" name="ANSELA" />
            <bitfield mask="0x00000080" name="ANSELA" />
            <bitfield mask="0x00000100" name="ANSELA" />
            <bitfield mask="0x00000200" name="ANSELA" />
            <bitfield mask="0x00000400" name="ANSELA" />
            <bitfield mask="0x00000800" name="ANSELA" />
            <bitfield mask="0x00001000" name="ANSELA" />
            <bitfield mask="0x00002000" name="ANSELA" />
            <bitfield mask="0x00004000" name="ANSELA" />
            <bitfield mask="0x00008000" name="ANSELA" />
         </register>
         <register caption="" name="ANSELB" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSELB" />
            <bitfield mask="0x00000002" name="ANSELB" />
            <bitfield mask="0x00000004" name="ANSELB" />
            <bitfield mask="0x00000008" name="ANSELB" />
            <bitfield mask="0x00000010" name="ANSELB" />
            <bitfield mask="0x00000020" name="ANSELB" />
            <bitfield mask="0x00000040" name="ANSELB" />
            <bitfield mask="0x00000080" name="ANSELB" />
            <bitfield mask="0x00000100" name="ANSELB" />
            <bitfield mask="0x00000200" name="ANSELB" />
            <bitfield mask="0x00000400" name="ANSELB" />
            <bitfield mask="0x00000800" name="ANSELB" />
            <bitfield mask="0x00001000" name="ANSELB" />
            <bitfield mask="0x00002000" name="ANSELB" />
            <bitfield mask="0x00004000" name="ANSELB" />
            <bitfield mask="0x00008000" name="ANSELB" />
         </register>
