MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX274F256B.atdf
         <register caption="" name="SPI2BUF" offset="0x220" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI2BUF" />
         </register>
         <register caption="" name="SPI1BRG" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="SPI1BRG" />
         </register>
         <register caption="" name="SPI2BRG" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="SPI2BRG" />
         </register>
         <register caption="SPI Control Register 2" name="SPI1CON2" offset="0x40" rw="RW" size="4">
            <bitfield caption="Audio Protocol Mode bit" mask="0x00000003" name="AUDMOD" values="SPI1CON2__AUDMOD" />
            <bitfield caption="Transmit Audio Data Format bit" mask="0x00000008" name="AUDMONO" values="SPI1CON2__AUDMONO" />
            <bitfield caption="Enable Audio CODEC Support bit" mask="0x00000080" name="AUDEN" values="SPI1CON2__AUDEN" />
            <bitfield caption="Ignore Transmit Underrun bit" mask="0x00000100" name="IGNTUR" values="SPI1CON2__IGNTUR" />
            <bitfield caption="Ignore Receive Overflow bit" mask="0x00000200" name="IGNROV" values="SPI1CON2__IGNROV" />
            <bitfield caption="Enable Interrupt Events via SPITUR bit" mask="0x00000400" name="SPITUREN" values="SPI1CON2__SPITUREN" />
            <bitfield caption="Enable Interrupt Events via SPIROV bit" mask="0x00000800" name="SPIROVEN" values="SPI1CON2__SPIROVEN" />
            <bitfield caption="Enable Interrupt Events via FRMERR bit" mask="0x00001000" name="FRMERREN" values="SPI1CON2__FRMERREN" />
            <bitfield caption="Sign Extend Read Data from the RX FIFO bit" mask="0x00008000" name="SPISGNEXT" values="SPI1CON2__SPISGNEXT" />
         </register>
         <register caption="SPI Control Register 2" name="SPI2CON2" offset="0x240" rw="RW" size="4">
            <bitfield caption="Audio Protocol Mode bit" mask="0x00000003" name="AUDMOD" values="SPI2CON2__AUDMOD" />
            <bitfield caption="Transmit Audio Data Format bit" mask="0x00000008" name="AUDMONO" values="SPI2CON2__AUDMONO" />
            <bitfield caption="Enable Audio CODEC Support bit" mask="0x00000080" name="AUDEN" values="SPI2CON2__AUDEN" />
            <bitfield caption="Ignore Transmit Underrun bit" mask="0x00000100" name="IGNTUR" values="SPI2CON2__IGNTUR" />
            <bitfield caption="Ignore Receive Overflow bit" mask="0x00000200" name="IGNROV" values="SPI2CON2__IGNROV" />
            <bitfield caption="Enable Interrupt Events via SPITUR bit" mask="0x00000400" name="SPITUREN" values="SPI2CON2__SPITUREN" />
            <bitfield caption="Enable Interrupt Events via SPIROV bit" mask="0x00000800" name="SPIROVEN" values="SPI2CON2__SPIROVEN" />
            <bitfield caption="Enable Interrupt Events via FRMERR bit" mask="0x00001000" name="FRMERREN" values="SPI2CON2__FRMERREN" />
            <bitfield caption="Sign Extend Read Data from the RX FIFO bit" mask="0x00008000" name="SPISGNEXT" values="SPI2CON2__SPISGNEXT" />
         </register>
      </register-group>
      <value-group caption="SPI Receive Buffer Full Interrupt Mode bits" name="SPI1CON__SRXISEL">
         <value caption="Interrupt is generated when the buffer is full" name="" value="0x3" />
         <value caption="Interrupt is generated when the buffer is full by one-half or more" name="" value="0x2" />
         <value caption="Interrupt is generated when the buffer is not empty" name="" value="0x1" />
         <value caption="Interrupt is generated when the last word in the receive buffer is read (i.e. buffer is empty)" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Transmit Buffer Empty Interrupt Mode bits" name="SPI1CON__STXISEL">
         <value caption="Interrupt is generated when the buffer is not full (has one or more empty elements)" name="" value="0x3" />
         <value caption="Interrupt is generated when the buffer is empty by one-half or more" name="" value="0x2" />
         <value caption="Interrupt is generated when the buffer is completely empty" name="" value="0x1" />
         <value caption="Interrupt is generated when the last transfer is shifted out of SPISR and transmit operations are complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Disable SDI bit" name="SPI1CON__DISSDI">
         <value caption="SDI pin is not used by the SPI module (pin is controlled by PORT function)" name="" value="0x1" />
         <value caption="SDI pin is controlled by the SPI module" name="" value="0x0" />
      </value-group>
      <value-group caption="Master Mode Enable bit" name="SPI1CON__MSTEN">
         <value caption="Master mode" name="" value="0x1" />
         <value caption="Slave mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Polarity Select bit" name="SPI1CON__CKP">
         <value caption="Idle state for clock is a high level; active state is a low level" name="" value="0x1" />
         <value caption="Idle state for clock is a low level; active state is a high level" name="" value="0x0" />
      </value-group>
      <value-group caption="Slave Select Enable bit" name="SPI1CON__SSEN">
         <value caption="SSx pin used for Slave mode" name="" value="0x1" />
         <value caption="SSx pin not used for Slave mode" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Clock Edge Select bit" name="SPI1CON__CKE">
         <value caption="Serial output data changes on transition from active clock state to Idle clock state (see CKP bit)" name="" value="0x1" />
         <value caption="Serial output data changes on transition from Idle clock state to active clock state (see CKP bit)" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Data Input Sample Phase bit (master mode only)" name="SPI1CON__SMP">
         <value caption="(Master mode) Input data sampled at end of data output time / (Slave mode) value is ignored" name="" value="0x1" />
         <value caption="(Master mode) Input data sampled at middle of data output time / (Slave mode) value is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="32/16-Bit Communication Select bits" name="SPI1CON__MODE32">
         <value caption="(AUDEN=1) 24-bit Data, 32-bit FIFO, 32-bit Channel/64-bit Frame/(AUDEN=0) 32-bit Data" name="" value="0x3" />
         <value caption="(AUDEN=1) 32-bit Data, 32-bit FIFO, 32-bit Channel/64-bit Frame/(AUDEN=0) 32-bit Data" name="" value="0x2" />
         <value caption="(AUDEN=1) 16-bit Data, 16-bit FIFO, 32-bit Channel/64-bit Frame/(AUDEN=0) 16-bit Data" name="" value="0x1" />
         <value caption="(AUDEN=1) 16-bit Data, 16-bit FIFO, 16-bit Channel/32-bit Frame/(AUDEN=0) 8-bit Data" name="" value="0x0" />
      </value-group>
      <value-group caption="Disable SDOx pin bit" name="SPI1CON__DISSDO">
         <value caption="SDOx pin is not used by the module. Pin is controlled by associated PORT register" name="" value="0x1" />
         <value caption="SDOx pin is controlled by the module" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="SPI1CON__SIDL">
         <value caption="Discontinue operation when CPU enters in Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Peripheral On bit" name="SPI1CON__ON">
         <value caption="SPI/I2S module is enabled" name="" value="0x1" />
         <value caption="SPI/I2S module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Enhanced Buffer Enable bit" name="SPI1CON__ENHBUF">
         <value caption="Enhanced Buffer mode is enabled" name="" value="0x1" />
         <value caption="Enhanced Buffer mode is disabled" name="" value="0x0" />
      </value-group>
