MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX274F256B.atdf
         <register caption="USB Endpoint 7 Control Register" name="U1EP7" offset="0x330" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP7__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP7__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP7__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP7__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP7__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 8 Control Register" name="U1EP8" offset="0x340" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP8__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP8__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP8__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP8__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP8__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 9 Control Register" name="U1EP9" offset="0x350" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP9__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP9__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP9__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP9__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP9__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 10 Control Register" name="U1EP10" offset="0x360" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP10__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP10__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP10__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP10__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP10__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 11 Control Register" name="U1EP11" offset="0x370" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP11__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP11__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP11__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP11__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP11__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 12 Control Register" name="U1EP12" offset="0x380" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP12__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP12__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP12__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP12__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP12__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 13 Control Register" name="U1EP13" offset="0x390" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP13__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP13__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP13__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP13__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP13__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 14 Control Register" name="U1EP14" offset="0x3a0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP14__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP14__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP14__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP14__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP14__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 15 Control Register" name="U1EP15" offset="0x3b0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP15__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP15__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP15__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP15__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP15__EPCONDIS" />
         </register>
      </register-group>
      <value-group caption="A-Device Vbus Change Indicator bit" name="U1OTGIR__VBUSVDIF">
         <value caption="Change on the session valid input is detected" name="" value="0x1" />
         <value caption="No change on the session valid input is detected" name="" value="0x0" />
      </value-group>
